blog/2014-10-27-org-mode-and-octopress.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Org-mode and Octopress - 记往开来</title>
  <meta name="author" content="Xiao Liu">

  
  <meta name="description" content="">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://xiaoliuai.github.io/blog/2014-10-27-org-mode-and-octopress.html">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/bootstrap/bootstrap.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/stylesheets/bootstrap/responsive.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/stylesheets/syntax/syntax.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/atom.xml" rel="alternate" title="记往开来" type="application/atom+xml">
  
  

</head>

<body   >
  <nav role="navigation"><div class="navbar navbar-inverse">
  <div class="navbar-inner">
    <div class="container">
      <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
      </a>

      <a class="brand" href="/">记往开来</a>

      <div class="nav-collapse">
        <ul class="nav">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>


        <ul class="nav pull-right" data-subscription="rss">
          <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
          
        </ul>

        
          <form class="pull-right navbar-search" action="https://www.google.com/search" method="get">
            <fieldset role="search">
              <input type="hidden" name="q" value="site:xiaoliuai.github.io" />
              <input class="search-query" type="text" name="q" results="0" placeholder="Search"/>
            </fieldset>
          </form>
        
      </div>
    </div>
  </div>
</div>
</nav>
  <div class="container">
    <div class="row-fluid">
      
<article class="hentry span9" role="article">

  
  <header class="page-header">
    
      <h1 class="entry-title">Org-mode and Octopress</h1>
    
    
      <p class="meta">
        








  


<time datetime="2014-10-27T00:00:00+01:00" pubdate data-updated="true"></time>
        
      </p>
    
  </header>


<div class="entry-content"><div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Writing Blog Using Org-mode and Octopress</a></li>
<li><a href="#sec-2">2. Octopress Installation</a>
<ul>
<li><a href="#sec-2-1">2.1. Installation of old version ruby with rbenv</a></li>
<li><a href="#sec-2-2">2.2. Setup the octopress</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Setup</a></li>
<li><a href="#sec-2-2-2">2.2.2. Dirctory structure comments</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Emacs Configuration</a>
<ul>
<li><a href="#sec-3-1">3.1. Org-octopress package</a></li>
<li><a href="#sec-3-2">3.2. <span class="todo TODO">TODO</span> <code>[0/3]</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Writing Blog Using Org-mode and Octopress</h2>
<div class="outline-text-2" id="text-1">
<p>
After the installation  and the configuration of jekyll along with
the org-mode. I tried to find some configurations to facilitate the
creation of org files (create file with date in front of file name,
insert heads, etc.) I did not realize the existence of relative
emacs packages in elpa and asked google for solutions. My
inefficient search key-words let the google returns undisired
answser: the <b>octopress</b>. Octopress is based on the jekyll, but
provide richer blog settings. Finally, I migrated to octopress and
use it to manager my github pages.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Octopress Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Installation of octopress is little complexe since it requires low
version ruby.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Installation of old version ruby with rbenv</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You can following the instructions on the <a href="http://octopress.org/docs/setup/rbenv">official manual</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Setup the octopress</h3>
<div class="outline-text-3" id="text-2-2">
<p>
My setup expierence is basically the same with the <a href="http://octopress.org/docs/setup/">official
manual</a>. However, after the installation, I replaced the octopress
directory to <code>~/WorkSpace/xiaoliuai.github.io</code> because it actually
becomes the repository of my github pages (<b>magnific!</b>). So I
suggest to clone the octopress git repository into the directory
with the same name of the repository of your github pages at the
beginning.
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Setup</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Copy octopress repository (<sub>I</sub> suggest to clone shallow copy with
option =depth=_)
<div class="org-src-container">

<pre class="src src-sh">git clone git://github.com/imathis/octopress.git octopress
<span style="color: #5859b7;">cd</span> octopress
</pre>
</div>
</li>
<li>Install dependencies
<div class="org-src-container">

<pre class="src src-sh">gem install bundler
rbenv rehash    <span style="color: #81908f; font-style: italic;"># </span><span style="color: #81908f; font-style: italic;">If you use rbenv, rehash to be able to run the bundle command</span>
bundle install
</pre>
</div>
</li>
<li>Install the default theme (<sub>I</sub> suggest to ignore this step and
install the 3rd-party theme directly_)
<div class="org-src-container">

<pre class="src src-sh">rake install
</pre>
</div>
</li>
<li>Install the 3rd-party theme (optional)
</li>
<li>Add 3rd-party tools (optional)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Dirctory structure comments</h4>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs Configuration</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Org-octopress package</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> tags
</li>
<li><code>[&#xa0;]</code> automatically inserted categories
</li>
<li><code>[&#xa0;]</code> functions of contents in setupfile.org
</li>
</ul>
<p>

</p>
</div>
</div>
</div>
</div>


  <footer>
    <p class="meta">
      
  

<span class="byline author vcard">Posted by <span class="fn">Xiao Liu</span></span>

      








  


<time datetime="2014-10-27T00:00:00+01:00" pubdate data-updated="true"></time>
      

<span class="categories">
  
    <a class='category' href='/blog/categories/blog/'>blog</a>, <a class='category' href='/blog/categories/emacs/'>emacs</a>, <a class='category' href='/blog/categories/octopress/'>octopress</a>, <a class='category' href='/blog/categories/org/'>org</a>
  
</span>


    </p>
    
      <div class="sharing">
  
  <a href="http://twitter.com/share" class="twitter-share-button" data-url="http://xiaoliuai.github.io/blog/2014-10-27-org-mode-and-octopress.html" data-via="" data-counturl="http://xiaoliuai.github.io/blog/2014-10-27-org-mode-and-octopress.html" >Tweet</a>
  
  
  
</div>

    
    
    <ul class="pager">
      
      <li><a href="/blog/archives">Blog Archives</a></li>
      
      <li class="next"><a class="basic-alignment right" href="/blog/2014-10-27-writing-blog-using-org-mode-and-jekyll.html"
        title="Next Post: Writing Blog Using Org-mode and Jekyll">Writing Blog Using Org-mode and Jekyll
        &raquo;</a></li>
      
    </ul>
  </footer>
</article>

<aside class="sidebar-nav span3">
  
    <section class="well">
  <ul id="recent_posts" class="nav nav-list">
    <li class="nav-header">Recent Posts</li>
    
      <li class="post">
        <a href="/blog/2014-10-27-writing-blog-using-org-mode-and-jekyll.html">Writing Blog Using Org-mode and Jekyll</a>
      </li>
    
      <li class="post">
        <a href="/blog/2014-10-27-org-mode-and-octopress.html">Org-mode and Octopress</a>
      </li>
    
  </ul>
</section>





  
</aside>


    </div>
  </div>
  <footer role="contentinfo" class="page-footer"><hr>
<p>
  Copyright &copy; 2014 - Xiao Liu -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  







  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
